app/controllers/school_classes_controller.rb

    def update
        @school_class = SchoolClass.find(params[:id])
        @school_class.update school_class_params
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2019-05-20 20:34:47.933625"], ["id", 1]]