app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Marcus"], ["last_name", "Mellor"], ["created_at", "2019-05-21 17:10:28.034460"], ["updated_at", "2019-05-21 17:10:28.034460"]]
---
  def create
    @student = Student.create(set_params)

UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2019-05-21 08:11:58.722619"], ["id", 1]]
---
  def update
    @student.update(set_params)